import imageSamurai from '@/images/blog/samurai.jpg'
import imagePizza from '@/images/blog/pizza.jpg'
import blogCardImage from '@/images/blog/blog-card-image.jpg'
import {StaticImageData} from "next/image";

export const blogData = [
  {
    title: 'Кодекс городского самурая',
    description: 'Эталоном сильного духа традиционно считаются самураи, но мало кто знает, что бусидо сводится к трем основным постулатам: пиши стихи, пей чай, умри достойно. С годами список требований к силе духа значительно увеличился, и в наши дни кодекс современного самурая в городских условиях выглядит, примерно, так:',
    date: new Date("2017-01-26"),
    link: 'https://testlink',
    image: blogCardImage,
    time: '8 минут'
  },
  {
    title: 'Проверенный рецепт домашней пиццы с грибами и сыром',
    description: 'Как сделать пиццу Маргарита в домашних условиях? Муку используйте высшего сорта. Ее необходимо просеивать, чтобы убрать мелкий мусор, насытить тесто кислородом и оно хорошо поднялось. Оливковое масло используется в классическом рецепте теста для пиццы. Но его можно заменить на любое другое рафинированное масло.',
    date: new Date("2023-01-05"),
    link: 'https://testlink',
    image: blogCardImage,
    time: '8 минут'
  },
  {
    title: 'Кодекс городского самурая',
    description: 'Эталоном сильного духа традиционно считаются самураи, но мало кто знает, что бусидо сводится к трем основным постулатам: пиши стихи, пей чай, умри достойно. С годами список требований к силе духа значительно увеличился, и в наши дни кодекс современного самурая в городских условиях выглядит, примерно, так:',
    date: new Date("2017-01-26"),
    link: 'https://testlink',
    image: blogCardImage,
    time: '8 минут'
  },
  {
    title: 'Проверенный рецепт домашней пиццы',
    description: 'Как сделать пиццу Маргарита в домашних условиях? Муку используйте высшего сорта. Ее необходимо просеивать, чтобы убрать мелкий мусор, насытить тесто кислородом и оно хорошо поднялось. Оливковое масло используется в классическом рецепте теста для пиццы. Но его можно заменить на любое другое рафинированное масло.',
    date: new Date("2023-01-05"),
    link: 'https://testlink',
    image: blogCardImage,
    time: '8 минут'
  },
]
