import { StaticImageData } from 'next/image';

interface service {
  group: string,
  services: object[],
}

export const servicesData: service[] = [
  {
    group: 'Разработка сайтов',
    services: [
      {
        name: 'Адаптивная верстка',
        cost: '400'
      },
      {
        name: 'Сайт на Tilda',
        cost: '5000'
      },
      {
        name: 'Сайт на готовом решении Bitrix',
        cost: '20000'
      },
      { name: 'Анализ бизнеса и конкурентов' },
      { name: 'Прототипирование' },
      { name: 'Дизайн главной и второстепенных страниц' },
      { name: 'Адаптивная верстка' },
      { name: 'Интеграция верстки и CMS' },
      { name: 'Копирайтинг и рерайтинг' },
      { name: 'Внесение контента' },
      { name: 'Обработка, поиск текстов и изображений' },
      { name: 'Синхронизация с 1С' },
      { name: 'Парсинг каталогов' },
      { name: 'Подключение онлайн оплаты' },
      { name: 'Подключение сервисов доставки' },
      { name: 'Установка счетчиков' },
      { name: 'Настройка и доработка готовых тем оформления' },
      { name: 'Создание интерактивных карт объектов' }
    ]
  },
  {
    group: 'Сопровождение сайтов',
    services: [
      {
        name: 'Наполнение контентом',
        cost: '400'
      },
      {
        name: 'Администрирование',
        cost: '500'
      },
      {
        name: 'Ускорение сайта',
        cost: '2000'
      },
      {
        name: 'Очистка от мусора',
        cost: '4000'
      },
      {name: 'Перенос сайтов на другой хостинг'},
      {name: 'Антивирусное лечение'},
      {name: 'Исправление ошибок'},
      {name: 'Изменение контента'},
      {name: 'Корректировки верстки'},
      {name: 'Функциональные доработки'},
      {name: 'Создание калькуляторов'},
      {name: 'Формы заявок'},
      {name: 'Установка тегов ремаркетинга'},
      {name: 'Установка счетчиков статистики посещений'},
      {name: 'Установка коллтрекинга'},
      {name: 'Установка онлайн-чатов'},
      {name: 'Копирайтинг, регайтинг'},
      {name: 'Поиск и обработка изображений'},
      {name: 'Создание баннеров'},
      {name: 'Обучение клиента работе в CMS'},
      {name: 'Изменение цен в каталогах'},

    ]
  },
  {
    group: 'Сопровождение сайтов',
    services: [
      {
        name: 'Наполнение контентом',
        cost: '400'
      },
      {
        name: 'Администрирование',
        cost: '500'
      },
      {
        name: 'Ускорение сайта',
        cost: '2000'
      },
      {
        name: 'Очистка от мусора',
        cost: '4000'
      }
    ]
  },
  {
    group: 'Сопровождение сайтов',
    services: [
      {
        name: 'Наполнение контентом',
        cost: '400'
      },
      {
        name: 'Администрирование',
        cost: '500'
      },
      {
        name: 'Ускорение сайта',
        cost: '2000'
      },
      {
        name: 'Очистка от мусора',
        cost: '4000'
      }
    ]
  },
  {
    group: 'Сопровождение сайтов',
    services: [
      {
        name: 'Наполнение контентом',
        cost: '400'
      },
      {
        name: 'Администрирование',
        cost: '500'
      },
      {
        name: 'Ускорение сайта',
        cost: '2000'
      },
      {
        name: 'Очистка от мусора',
        cost: '4000'
      }
    ]
  },
  {
    group: 'Сопровождение сайтов',
    services: [
      {
        name: 'Наполнение контентом',
        cost: '400'
      },
      {
        name: 'Администрирование',
        cost: '500'
      },
      {
        name: 'Ускорение сайта',
        cost: '2000'
      },
      {
        name: 'Очистка от мусора',
        cost: '4000'
      }

    ]
  },
  {
    group: 'Сопровождение сайтов',
    services: [
      {
        name: 'Наполнение контентом',
        cost: '400'
      },
      {
        name: 'Администрирование',
        cost: '500'
      },
      {
        name: 'Ускорение сайта',
        cost: '2000'
      },
      {
        name: 'Очистка от мусора',
        cost: '4000'
      }
    ]
  }
];
